// საკლასო დავალება:

// შექმენით jsx-ის ელემენტი და მასში შეინახეთ div ბლოკი. ამ დივში უნდა გქონდეთ 5 განსხვავებული ელემენტი და თითოეულს ჰქონდეს თავისი ატრიბუტი.

const jsxEl = (
    <div>
        <p id="p1">Hello World!</p>

        <h1 id="h1-1">Petre Sikmashvili</h1>

        <buttom id="btn1">Click Me</buttom>

        <h6 id="h6-1">Hi</h6>

        <b id="b1">Bold</b>
    </div>
);


// საკლასო დავალება:

// შექმენით ობიექტი, 3 კუთვნილებით და თითოეულში ნებისმიერი სთრინგი შეინახეთ.

// შექმენით ცვლადი, სადაც შეინახება jsx-ის ელემენტი div. div-ში უნდა გქონდეთ 3 პარაგრაფი. თითოეული პარაგრაფის ტექსტი უნდა იყოს ობიექტის კუთვნილება.

const obj1 = {
    name: "Petre",
    surname: "Sikmashvili",
    age: "11"
};

const objEl = (
    <div>
        <p>{obj1.name}</p>

        <p>{obj1.surname}</p>

        <p>{obj1.age}</p>
    </div>
);