// საკლასო დავალება:

// ვებსაიტზე დაამატეთ ერთი ღილაკი და მას გაუწერეთ id.

// js-ში შექმენით ერთი ფუნქცია, რომელიც მომხმარებელს შემოატანინებს ფერს და მას შეინახავს ცვლადში. თქვენი დავალებაა, რომ ამ ღილაკის ფონის ფერი გახდეს მომხმარებლის მიერ შემოტანილი ფერი. 

// ეს ფუნქცია გაუშვით მაშინ, როდესაც მომხმარებელი დააკლიკებს ღილაკს.

const button = document.getElementById("b1");

function changeButtonColor() {
    let userColor = prompt("Enter color):");
    button.style.backgroundColor = userColor;
}
