// საკლასო დავალება:

// შექმენით ობიექტი, რომელსაც ექნება შემდეგი კუთვნილებები: name, surname, academy, role, city, favColor, favLanguage. ასევე, ამ ობიექტში დაამატეთ მეთოდი, რომელიც უბრალოდ "Hello"-ს დაბეჭდავს კონსოლში. შემდეგ დაამატეთ კიდევ ერთი მეთოდი, რომელიც კონსოლში დაბეჭდავს ამ ობიექტის ნებისმიერ კუთვნილებას.

// დაბეჭვდა:
// 1. დაბეჭდეთ მთლიანი ობიექტი.
// 2. დაბეჭდეთ ობიექტის რომელიმე კუთვნილების მნიშვნელობა.
// 3. ობიექტის რომელიმე კუთვნილებას შეუცვალეთ მნიშვნელობა და დაბეჭდეთ განახლებული მნიშვნელობა.
// 4. გამოიძახეთ ობიექტის რომელიმე მეთოდი

let user_info = {
    name: "Petre",
    surname:"Sikmashvili",
    acadeemy: "GOA",
    role: "pupil",
    city: "Tbilisi",
    favcolor: "yellow",
    favLanguage: "CSS",

    greet() {
        console.log("Hello");
    }
}