// საკლასო დავალება:

// html-ის სტრუქტურაში დაამატეთ ერთი ღილაკი და მას გაუწერეთ id.

// js-ში წამოიღეთ ეს ელემენტი და მასზე დაამატეთ მოვლენის მსმენელი. მოვლენა უნდა იყოს დაკლიკება და მის ფუნქციას გაუწერეთ e პარამეტრი. 

// პირველ რიგში, კონსოლში დაბეჭდეთ e პარამეტრის მნიშვნელობა. შემდეგ, e პარამეტრი და target კუთვნილებით შეცვალეთ ამ ღილაკის ფონის ფერი და გაწერეთ რომ ის გახდეს შავი

let button = document.getElementById("b1");

button.addEventListener("click", function(e) {
    console.log(e);
    e.target.style.backgroundColor = "black";
});