// 1)შექმენით 5 ელემენტიანი სია და შეამოწმეთ ყველა რიცხვი თუ არის კენტი რიცხვი, გამოიყენეთ .every() მეთოდი

// 2)ახსენით კომენტარებით რა არის every() მეთოდი

const list1 = [1, 2, 3, 4, 5]

const num1 = list1.every(function(num2) {
    return num2 %2 !== 0
})

console.log(num1)

// every ამოწმებს შეესაბამება თუ არა მასივის ყველა ელემენტი ერთ პირობას.
// თუ ყველა შეესაბამება ერთმანეთს აბრუნებს true-ს, თუ რომელიმე არა აბრუნებს false-ს.

// 3)შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ every() მეთოდის საშუალებით შეამოწმეთ სიის ყველა ელემენტი თუ სახელის სოგრძე არი 3 სიმბოლოზე მეტუ უნდა დაბრუნდეს true

const list2 = ["Davit", "Nikoloz", "Petre", "Giorgi", "Nia"]

const str1 = list2.every(function(str2) {
    return str2.length > 3
})

console.log(str1)

// 4) შექმენით სია რომელიც შედგება რიცხვებისგან შემდეგ გაფილტრეთ ლუწი და კენტი რიცხვები ერთმანეთისგან .filter() მეთოდი

// 5)შექმენით სია რომელიც შეგდება სახელებისგან შემდეგ კი find() მეთოდის საშუალებით იპოვე ის ელემენტი რომელიც შედგება 4 სიმბოლოსგან

// 6) ახსენით რას აკეთებს filter() და find() მეთოდები

const num0 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const num01 = num0.filter(function(num001) {
    return num001 % 2 === 0;
});

const num02 = num0.filter(function(num002) {
    return num002 % 2 !== 0;
});

console.log(num01)
console.log(num02)

const str01 = ["Petre", "Luka", "Gio", "Dato", "Natia"]

const str02 = str01.find(function(str001) {
    return str001.length === 4
})

console.log(str02)

// filter ირჩევს მასივიდან ყველა იმ ელემენტს,
// რომლებიც ფუნქციის ცვლადშია მოცემული და პირობას აბრუნებს ახალ მასივში.

// find პოულობს მასივში პირველ ელემენტს.