# საკლასო დავალება:

# მომხმარებელს შემოატანინეთ ორი მთელი რიცხვი და შეინახეთ ისინი ცვლადებში.

# თუ პირველი რიცხვი მეტია მეორეზე, შექმენით დიაპაზონი, რომლის საწყისი რიცხვი იქნება მეორე და საბოლოო პირველი.

# თუ მეორე რიცხვი მეტია პირველზე, შექმენით დიაპაზონი, რომლის საწყისი რიცხვი იქნება პირველი და საბოლოო მეორე.

# სხვა შემთხვევაში (როდესაც ეს ორი რიცხვი ტოლია), დაბეჭდეთ "numbers are equal".

# საბოლოოდ, შექმნლის დიაპაზონს გადაუარეთ for ციკლით და დაბეჭდეთ საიტერაციო ცვლადის მნიშვნელობა თითოეულ იტერაციაზე.

num1 = int(input("Enter Number: "))
num2 = int(input("Enter Number: "))

if num1 > num2: range1 =range(num2, num1 + 1)
elif num2 > num1: range1 = range(num1, num2 + 1)
else: print("numbers are equal")

for i in range1: print(i)